Revit 2027 API
BarTypeDiameterOptions.BarMassPerUnitLength Property
 Represents the bar mass per unit length of the RebarBarType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double BarMassPerUnitLength { get; set; }
Public Property BarMassPerUnitLength As Double
	Get
	Set
public:
property double BarMassPerUnitLength {
	double get ();
	void set (double value);
}
member BarMassPerUnitLength : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for barMassPerUnitLength must be non-negative.
See Also
Reference
BarTypeDiameterOptions Class
Autodesk.Revit.DB Namespace